[
    {
        "name": "ArgentBank",
        "description": "Dans le cadre de la conception d'une application web React pour un nouveau système d'authentification des utilisateurs, j'ai été chargée de développer la phase 1, qui se concentre sur l'authentification des utilisateurs. La mission principale était de créer une application web complète et responsive en utilisant React, avec une gestion d'état via Redux. Les pages principales comprenaient la page d'accueil, la page de connexion et la page de profil. Les fonctionnalités principales de l'application comprenaient : <ul><li>- Possibilité pour l'utilisateur de visiter la page d'accueil.</li><li>- Fonctionnalité de connexion permettant à l'utilisateur de se connecter au système, avec gestion des erreurs pour les identifiants incorrects.</li><li>- Fonctionnalité de déconnexion de l'utilisateur.</li> <li>- Accès restreint aux informations du profil de l'utilisateur après une connexion réussie.</li><li>- Capacité à modifier le pseudo de l'utilisateur, mais pas son nom ni son prénom.</li></ul><br>Les routes API nécessaires pour interagir avec le backend étaient déjà fournies par l'équipe backend, avec une documentation Swagger incluse dans le référentiel. Un accent particulier a été mis sur l'optimisation du code et des ressources, en suivant les bonnes pratiques de Green Code. Cela impliquait notamment l'optimisation des images et la création de composants réutilisables. </br></br>Pour la phase 2 du projet, qui impliquait la gestion des transactions, une réflexion a été entamée sur la modélisation des routes API backend en fonction des besoins prévus, en suivant les directives de Swagger. Cela impliquait de décrire en détail chaque endpoint, y compris la méthode HTTP, la route, la description de l'endpoint, les paramètres possibles et les réponses attendues. Le projet a été mené en suivant une approche collaborative, avec des revues de code régulières et des discussions sur les choix d'architecture et de conception.",
        "date": "2023-2024",
        "tags": ["React", "Redux", "Authentification"],
        "image": "argentbank.webp",
        "githubLink": "https://github.com/anakhlf/ArgentBank-website.git"
    },
    {
        "name": "Portefolio Nina Carducci",
        "description": "Ce projet avait pour objectif d'améliorer les performances d'un site web existant, d'accroître sa visibilité sur les moteurs de recherche via le référencement local, d'optimiser sa présence sur les réseaux sociaux et de garantir l'accessibilité à tous les utilisateurs. <br><br> Pour ce faire, j'ai mis en œuvre une série d'actions stratégiques. Tout d'abord, j'ai travaillé sur l'optimisation technique du site pour assurer une expérience de navigation rapide et fluide. Cela comprenait l'analyse et l'optimisation du code, la compression des ressources et la mise en cache efficace des éléments du site. <br><br>Parallèlement, j'ai élaboré une stratégie de référencement local afin d'augmenter la visibilité du site dans les résultats de recherche locaux pertinents et optimisé les balises meta.<br><br> Enfin, j'ai veillé à ce que le site soit accessible à tous les utilisateurs en mettant en place des pratiques d'accessibilité conformes aux normes WCAG. Cela garantit que le site est navigable et utilisable pour tous, quel que soit leur handicap ou leurs limitations. <br><br>À la fin de ce projet, j'ai fourni un rapport d'optimisation détaillé, documentant toutes les actions entreprises et évaluant leur impact sur le projet, offrant ainsi une vision claire et transparente des améliorations réalisées.",
        "date": "2023-2024",
        "tags": ["SEO", "Accessibilité", "Référencement"],
        "image": "nina.webp",
        "githubLink": "https://anakhlf.github.io/op-p9-nina/"
    },
    {
        "name": "Kasa",
        "description": "Le projet Kasa visait à développer une application React en conformité avec les maquettes Figma fournies, ainsi que les contraintes techniques et fonctionnelles spécifiées. Initialement prévu sans intégration back-end, l'application utilise les données des 20 dernières annonces de logements contenues dans un fichier JSON. <br><br>Les directives de développement exigent l'utilisation de Create React App ainsi que le respect des coding guidelines de Kasa pour garantir un code de qualité. Les maquettes Figma, organisées en logique de composants, offrent les ressources nécessaires telles que le logo et les icônes, tandis que des prototypes sont disponibles pour visualiser les animations attendues. <br><br>Les fonctionnalités principales incluent un défilement de galerie spécifique et des Collapses avec des comportements prédéfinis. L'objectif est de créer une interface utilisateur conforme aux maquettes, tout en assurant une gestion efficace des données et une qualité de code optimale.",
        "date": "2023-2024",
        "tags": ["React", "React Router", "Create React App"],
        "image": "kasa.webp",
        "githubLink": "https://github.com/anakhlf/op-p8.git"
    }
]